bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_power.c
    /* pre callback */
    if (cfg->preCbFun) {
        cfg->preCbFun();
    }

    /* always disable HBN pin pull up/down for reduce PDS0/1/2/3/7 current, 0x4000F014[16]=0 */
    HBN_Hw_Pu_Pd_Cfg(DISABLE);

    /* mask/unmask HBN pin wakeup, 0x4000F014[4:3] */
    HBN_Pin_WakeUp_Mask(~(cfg->pdsAonGpioWakeupSrc));
    HBN_Aon_Pad_IeSmt_Cfg(cfg->pdsAonGpioWakeupSrc);

    if (cfg->pdsAonGpioWakeupSrc != 0) {
        HBN_GPIO_INT_Enable(cfg->pdsAonGpioTrigType);
    }

#if ALWAYS_DISABLE_AON_PAD_9
    uint32_t tmpVal = 0, tmpVal2 = 0;

    /* always disable and mask aon_pad_GPIO9, mask/unmask and ie_enable/ie_disable */
    tmpVal = BL_RD_REG(HBN_BASE, HBN_IRQ_MODE);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_MASK);
    tmpVal2 |= (1 << 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_PIN_WAKEUP_MASK, tmpVal2);
    tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, HBN_REG_AON_PAD_IE_SMT);
    tmpVal2 &= ~(1 << 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, HBN_REG_AON_PAD_IE_SMT, tmpVal2);
    BL_WR_REG(HBN_BASE, HBN_IRQ_MODE, tmpVal);
#endif

    /* To make it simple and safe*/
    __disable_irq();

    if (cfg->powerDownFlash) {
        HBN_Power_Down_Flash(cfg->flashCfg);
        GLB_Select_External_Flash();
    }

    HBN_Set_Ldo11_All_Vout(cfg->ldoLevel);

    if (cfg->turnOffXtal32m) {
        HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_RC32M);
        AON_Power_Off_XTAL();
    }

    if (cfg->turnOffDll) {
        GLB_Power_Off_DLL();
    }

    /* power off PLL to reduce current  */
    if (cfg->turnoffPLL) {
        GLB_Set_System_CLK(GLB_DLL_XTAL_NONE, GLB_SYS_CLK_RC32M);
        PDS_Update_Flash_Ctrl_Setting(0);
        PDS_Power_Off_PLL();
    }

    /* pds0-pds7 : ldo11rt_iload_sel=3 */
    /* pds31     : ldo11rt_iload_sel=1 */
    if ((cfg->pdsLevel >= 0) && (cfg->pdsLevel <= 7)) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_25_250UA);
    } else if (cfg->pdsLevel == 31) {
        HBN_Set_Ldo11rt_Drive_Strength(HBN_LDO11RT_DRIVE_STRENGTH_10_100UA);
    } else {
        /* pdsLevel error */
    }

    switch (cfg->pdsLevel) {
        case 0:
            pPdsCfg = &pdsCfgLevel0;
            break;

        case 1:
            pPdsCfg = &pdsCfgLevel1;
            break;

        case 2:
            pPdsCfg = &pdsCfgLevel2;
            break;

        case 3:
            pPdsCfg = &pdsCfgLevel3;
            break;

        case 4:
            pPdsCfg = &pdsCfgLevel4;
            break;

        case 5:
            pPdsCfg = &pdsCfgLevel5;
            break;

        case 6:
            pPdsCfg = &pdsCfgLevel6;
            break;

        case 7:
            pPdsCfg = &pdsCfgLevel7;
            break;

        case 31:
            pPdsCfg = &pdsCfgLevel31;
            break;

        default:

            /* pdsLevel error */
            while (1) {
                BL702_Delay_MS(500);
            }

            break;
    }

    if (cfg->turnOffFlashPad) {
        switch (cfg->flashPinCfg) {
            case 0:

                /* turn_off_ext_flash_pin, GPIO23 - GPIO28 */
                for (uint32_t pin = 23; pin <= 28; pin++) {
                    GLB_GPIO_Set_HZ(pin);
                }

                HBN_Set_Pad_23_28_Pullup();
                break;

            case 1:

                /* turn_off_internal_flash_pin, GPIO23 - GPIO28 */
                for (uint32_t pin = 23; pin <= 28; pin++) {
                    GLB_GPIO_Set_HZ(pin);
                }

                break;

            case 2:

                /* turn_off_internal_flash_pin, GPIO23 - GPIO28 */
                for (uint32_t pin = 23; pin <= 28; pin++) {
                    GLB_GPIO_Set_HZ(pin);
                }

                break;

            case 3:

                /* turn_off_ext_flash_pin, GPIO17 - GPIO22 */
                for (uint32_t pin = 17; pin <= 22; pin++) {
                    GLB_GPIO_Set_HZ(pin);
                }

                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_23, PDS_PAD_CFG_PULL_UP);
                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_24, PDS_PAD_CFG_PULL_UP);
                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_25, PDS_PAD_CFG_PULL_UP);
                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_26, PDS_PAD_CFG_PULL_UP);
                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_27, PDS_PAD_CFG_PULL_UP);
                PDS_Set_Pad_Config(PDS_PAD_PIN_GPIO_28, PDS_PAD_CFG_PULL_UP);
                break;

            default:
                break;
        }

        pPdsCfg->pdsCtl.puFlash = 1; /* power switch setting, set 1 for internal flash, has no effect on ext flash */
    }

    if (cfg->pdsHoldGpio) {
        pPdsCfg->pdsCtl.gpioIePuPd = 1;
    } else {
        pPdsCfg->pdsCtl.gpioIePuPd = 0;
    }

    pPdsCfg->pdsCtl.pdsLdoVol = cfg->ldoLevel;
    pPdsCfg->pdsCtl.pdsLdoVselEn = 1;

    if (!(cfg->turnOffRF)) {
        pPdsCfg->pdsCtl.pdsCtlRfSel = 0;
    }

    /* config  ldo11soc_sstart_delay_aon =2 , cr_pds_pd_ldo11=0 to speedup ldo11soc_rdy_aon */
    AON_Set_LDO11_SOC_Sstart_Delay(0x2);

    PDS_Default_Level_Config(pPdsCfg, cfg->sleepTime);
    __WFI(); /* if(.wfiMask==0){CPU won't power down until PDS module had seen __wfi} */

    /* Wake up from PDS */
    /* post callback, mainly for GPIO or peripherals on/off */
    if (cfg->postCbFun) {
        cfg->postCbFun();
    }

    if (cfg->turnoffPLL) {
        GLB_Set_System_CLK(cfg->xtalType, GLB_SYS_CLK_DLL144M);
        PDS_Update_Flash_Ctrl_Setting(1);
    }

    if (cfg->turnOffFlashPad) {
        PDS_Power_On_Flash_Pad(cfg->flashPinCfg);
    }

    if (cfg->powerDownFlash) {
        PDS_Power_On_Flash(cfg); /* call GLB_Select_Internal_Flash() in this API */
    }

    /* always turn_on_sec_ring, may cost more current */
    SEC_Eng_Turn_On_Sec_Ring(); /* E_ITEM_04 */

    /* always enable sec_eng, may cost more current */
    Sec_Eng_Trng_Enable();

    HBN_Aon_Pad_IeSmt_Cfg(ENABLE);

    __enable_irq();
}

/**
 * @brief callback function before entry into pds
 *
 */
static void ATTR_TCM_SECTION PDS_Pre_CallBack(void)
{
    GLB_GPIO_Cfg_Type gpioCfg = {
        .gpioPin = GLB_GPIO_PIN_0,
        .gpioFun = GPIO_FUN_GPIO,
        .gpioMode = GPIO_MODE_INPUT,
        .pullType = GPIO_PULL_NONE,
        .drive = 0,
        .smtCtrl = 0,
    };

    /* turn off gpio except for CCI, GPIO0 - GPIO22 */
    for (GLB_GPIO_Type pin = GLB_GPIO_PIN_0; pin < GLB_GPIO_PIN_MAX; pin++) {
        GLB_CCI_Use_IO_0_1_2_7(DISABLE);
        GLB_CCI_Use_Jtag_Pin(DISABLE);

