bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_power.c
        /* flash pin GPIO17~GPIO22 */
        if ((pin >= GLB_GPIO_PIN_17) && (pin <= GLB_GPIO_PIN_22)) {
            continue;
        }

        /* flash pin GPIO23~GPIO28 */
        if ((pin >= GLB_GPIO_PIN_23) && (pin <= GLB_GPIO_PIN_28)) {
            continue;
        }

        /* DBG_TX pin */
        if (pin == GLB_GPIO_PIN_14) {
            continue;
        }

        gpioCfg.gpioPin = pin;
        GLB_GPIO_Init(&gpioCfg);
        GLB_GPIO_Set_HZ(gpioCfg.gpioPin);
    }

    if (glb_preCbFun != NULL) {
        glb_preCbFun();
    }
}

/**
 * @brief callback function after wake up form pds if cpu do not reset
 *
 */
static void ATTR_TCM_SECTION PDS_Post_CallBack(void)
{
    HBN_Set_Ldo11_Rt_Vout(HBN_LDO_LEVEL_1P00V);

    if (glb_postCbFun != NULL) {
        glb_postCbFun();
    }
}

int hbn_set_wakeup_addr(uint32_t addr)
{
    return HBN_Set_Wakeup_Addr(addr);
}

int hbn_set_status_flag(uint32_t flag)
{
    return HBN_Set_Status_Flag(flag);
}

/**
 * @brief enter cpu into pds mode
 *
 *      pds(power down sleep) mode will set CPU into sleep mode.
 *      cpu's behavior after wakeup depend on psd level
 *
 *      see flow table if cpu off , cpu will reset after wakeup
 *
 *                      PD_CORE     PD_CORE_MISC_DIG    PD_CORE_MISC_ANA    PD_CORE_CPU     PD_BZ   PD_USB
 *          PDS0          ON               ON                  ON               ON            ON      ON
 *          PDS1          ON               ON                  ON               ON            ON      OFF
 *          PDS2          ON               ON                  ON               ON            OFF     ON
 *          PDS3          ON               ON                  ON               ON            OFF     OFF
 *          PDS4          ON               ON                  ON               OFF           ON      ON
 *          PDS5          ON               ON                  ON               OFF           ON      OFF
 *          PDS6          ON               ON                  ON               OFF           OFF     ON
 *          PDS7          ON               ON                  ON               OFF           OFF     OFF
 *          PDS31         ON               OFF                 OFF              OFF           OFF     OFF
 *
 *
 * now default pds level is pds31
 * @return int
 */
int lp_enter_pds(uint32_t sleep_time, void (*preCbFun)(void), void (*postCbFun)(void))
{
    PDS_APP_CFG_Type pdsCfg = {
        .pdsLevel = 31,                                             /*!< PDS level */
        .turnOffXtal32m = DEFAULT_LP_PDS_TURN_OFF_XTAL_32M,         /*!< Wheather turn off XTAL32M */
        .turnOffDll = DEFAULT_LP_PDS_TURN_OFF_DLL,                  /*!< Wheather turn off DLL */
        .turnOffRF = DEFAULT_LP_PDS_TURN_OFF_RF,                    /*!< Wheather turn off RF */
        .useXtal32k = DEFAULT_LP_PDS_USE_XTAL_32K,                  /*!< Wheather use xtal 32K as 32K clock source,otherwise use rc32k */
        .pdsAonGpioWakeupSrc = DEFAULT_LP_PDS_AON_GPIO_WAKE_UP_SRC, /*!< PDS level 0-7,31 mode aon GPIO Wakeup source(HBN wakeup pin) */
        .pdsAonGpioTrigType = DEFAULT_LP_PDS_AON_GPIO_TRIG_TYPE,    /*!< PDS level 0-7,31 mode aon GPIO Triger type(HBN wakeup pin) */
        .powerDownFlash = DEFAULT_LP_PDS_FLASH_POWER_DOWN,          /*!< Whether power down flash */
        .pdsHoldGpio = DEFAULT_LP_PDS_HOLD_GPIO,                    /*!< Whether pds hold gpio level */
        .turnOffFlashPad = DEFAULT_LP_PDS_TURN_OFF_FLASH_PAD,       /*!< Whether turn off ext flash pad(GPIO17-GPIO22, GPIO23-GPIO28) */
        .flashPinCfg = 0,
        .turnoffPLL = 1,
        /*!< Whether trun off PLL */        /*!< 0 ext flash 23-28, 1 internal flash 23-28, 2 internal flash 23-28, 3 ext flash 17-22 */
        .xtalType = DEAULT_LP_XTAL_TYPE,    /*!< XTal type, used when user choose turn off PLL, PDS will turn on when exit PDS mode */
        .flashContRead = 0,                 /*!< Whether enable flash continue read */
        .sleepTime = 10 * 32768,            /*!< PDS sleep time */
        .flashCfg = &flashCfg_Gd_Q80E_Q16E, /*!< Flash config pointer, used when power down flash */
        .ldoLevel = DEFAULT_LP_LDO_LEVEL,   /*!< LDO level */
        .preCbFun = PDS_Pre_CallBack,       /*!< Pre callback function */
        .postCbFun = PDS_Post_CallBack,     /*!< Post callback function */
    };

    BL702_Delay_MS(2000);

    glb_preCbFun = preCbFun;
    glb_postCbFun = postCbFun;

    pdsCfg.sleepTime = sleep_time;

    HBN_Set_Ldo11_Rt_Vout(HBN_LDO_LEVEL_1P00V);

    PDS_WAKEUP_IRQHandler_Install();

    /* clear aon pads int status */
    HBN_Hw_Pu_Pd_Cfg(0);
    HBN_Aon_Pad_IeSmt_Cfg(0);
    HBN_Pin_WakeUp_Mask(0x1F);
    HBN_Clear_IRQ(HBN_INT_GPIO9);
    HBN_Clear_IRQ(HBN_INT_GPIO10);
    HBN_Clear_IRQ(HBN_INT_GPIO11);
    HBN_Clear_IRQ(HBN_INT_GPIO12);
    HBN_Clear_IRQ(HBN_INT_GPIO13);

    /* enable PDS interrupt to wakeup CPU (PDS1:CPU not powerdown, CPU __WFI) */
    CPU_Interrupt_Enable(PDS_WAKEUP_IRQn);

    /* clear and mask PDS int */
    PDS_IntMask(PDS_INT_WAKEUP, UNMASK);
    PDS_IntMask(PDS_INT_RF_DONE, MASK);
    PDS_IntMask(PDS_INT_PLL_DONE, MASK);
    PDS_IntClear();

    BL702_Delay_MS(100);

    PDS_Mode_Enter(&pdsCfg);

    while (1) {
        //MSG("pds wakeup and running.\r\n");
        BL702_Delay_MS(1000);
    }

    return 0;
}

/**
 * @brief enter cpu into hbn mode
 *
 * @param sleepTime sleep time
 * @return int
 *
 * @note now default hbn level is hbn1
 */
int lp_enter_hbn(uint32_t sleepTime, uint8_t hbn_level)
{
    HBN_APP_CFG_Type cfg = {
        .useXtal32k = 0,                                      /*!< Wheather use xtal 32K as 32K clock source,otherwise use rc32k */
        .sleepTime = sleepTime,                               /*!< HBN sleep time */
        .gpioWakeupSrc = DEFAULT_LP_PDS_AON_GPIO_WAKE_UP_SRC, /*!< GPIO Wakeup source */
        .gpioTrigType = DEFAULT_LP_PDS_AON_GPIO_TRIG_TYPE,    /*!< GPIO Triger type */
        .flashCfg = NULL,                                     /*!< Flash config pointer, used when power down flash */
        .flashPinCfg = 0,                                     /*!< 0 ext flash 23-28, 1 internal flash 23-28, 2 internal flash 23-28, 3 ext flash 17-22 */
        .hbnLevel = hbn_level,                                /*!< HBN level */
        .ldoLevel = HBN_LDO_LEVEL_0P90V,                      /*!< LDO level */
    };

    HBN_Out0_IRQHandler_Install();
    HBN_Out1_IRQHandler_Install();

    //HBN_Check_RAM(0);

    /* disable aon_pad(gpio7) will cause uart0_rx irq_req, __disable_irq() for all irq_req */
    __disable_irq();

    HBN_Mode_Enter(&cfg);

    while (1) {
        BL702_Delay_MS(1000);
    }

    return 0;
}
